{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Risky - Diabetes",
    "1": "Risky - Blood Pressure",
    "2": "Safe",
    "3": "Risky - Allergies",
    "4": "Risky - Heart Disease",
    "5": "Risky - Cholesterol",
    "6": "Risky - Cancer Risk",
    "7": "Risky - Gut Inflammation",
    "8": "Risky - Kidney Issues",
    "9": "Risky - Seafood Allergies"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Risky - Allergies": 3,
    "Risky - Blood Pressure": 1,
    "Risky - Cancer Risk": 6,
    "Risky - Cholesterol": 5,
    "Risky - Diabetes": 0,
    "Risky - Gut Inflammation": 7,
    "Risky - Heart Disease": 4,
    "Risky - Kidney Issues": 8,
    "Risky - Seafood Allergies": 9,
    "Safe": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
